Repository: igorfs10/fluru_tools
Catalog: lib/l10n/app_*.arb
Languages: pt

# homeTitle
source: Home
pt: Início

# jsonConverterTitle
source: Text type Convert
pt: Conversor de texto

# fileVerifierTitle
source: File Verifier
pt: Verificador de Arquivos

# requesterTitle
source: HTTP Requester
pt: Requisitador HTTP

# webVersionTitle
source: Web Version
pt: Versão Web

# downloadAppTitle
source: Download Desktop App
pt: Download Versão Desktop

# sourceCodeTitle
source: Source Code
pt: Código Fonte

# jsonConverterDescription
source: Convert and format JSON/CSV/YAML/XML data easily.
pt: Converte e formata dados JSON/CSV/YAML/XML facilmente.

# fileVerifierDescription
source: Verify the integrity of your files using MD5, SHA-1 or SHA-256.
pt: Verifique a integridade dos seus arquivos usando MD5, SHA-1 ou SHA-256.

# requesterDescription
source: Send and test HTTP requests with ease using HDOC format.
pt: Envie e teste requisições HTTP facilmente usando o formato HDOC.

# base64EncoderDescription
source: Encode and decode Base64 strings and files quickly.
pt: Codifique e decodifique strings e arquivos Base64 rapidamente.

# webVersionDescription
source: Access the web version of Fluru Tools.
pt: Acesse a versão web do Fluru Tools.

# downloadAppDescription
source: Download the desktop application for Fluru Tools.
pt: Baixe a versão desktop do Fluru Tools.

# sourceCodeDescription
source: Explore the source code of Fluru Tools on GitHub.
pt: Explore o código fonte do Fluru Tools no GitHub.

# developedBy
source: Developed by {author}
pt: Desenvolvido por {author}

source: Quick Access
pt: Acesso Rápido

# appDescription
source: A set of tools to help developers and tech enthusiasts with everyday tasks.
pt: Um conjunto de ferramentas para ajudar desenvolvedores e entusiastas de tecnologia com tarefas diárias.

# hereDocRequestExample
source: HDOC request example:
pt: Exemplo de requisição HDOC:

# hereDocRequestInfo
source: Required blocks: METHOD, URL. Supported blocks: HEADERS, BODY.
pt: Blocos obrigatórios: METHOD, URL. Blocos suportados: HEADERS, BODY.

# hereDocRequestCopy
source: Copy HDOC Example
pt: Copiar Exemplo HDOC

# hereDocRequestCopied
source: HDOC Example Copied to Clipboard
pt: Exemplo HDOC copiado para a área de transferência

source: Open File
pt: Abrir Arquivo

source: Save File
pt: Salvar Arquivo

source: Success
pt: Sucesso

source: Error
pt: Erro

source: Processing...
pt: Processando...

# base64FileSizeError
source: File size exceeds 20MB limit.
pt: O tamanho do arquivo excede o limite de 20MB.

# latestVersion
source: Latest: v{version}
pt: Última: v{version}

# hdocExceptionInvalidgMethod
source: Invalid HTTP Method. {method}
pt: Método HTTP inválido. {method}

# hdocExceptionMissingBlock
source: Missing {blockName} block.
pt: Bloco {blockName} ausente.

# hdocExceptionInvalidUrl
source: Invalid URL format. {url}
pt: Formato de URL inválido. {url}
